CSI API ETABS v1

# cSapModelDetailing Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDetailing Detailing { get; }

    ReadOnly Property Detailing As cDetailing
    	Get

    Dim instance As cSapModel
    Dim value As cDetailing

    value = instance.Detailing

    property cDetailing^ Detailing {
    	cDetailing^ get ();
    }

    abstract Detailing : cDetailing with get

#### Property Value

Type: cDetailing

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com